MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMI18/mcu.h
#define WUPE11                        0x00000180      // Wakeup Pin Enable For LLWU_P11
#define WUPE10                        0x00000060      // Wakeup Pin Enable For LLWU_P10
#define WUPE9                         0x00000018      // Wakeup Pin Enable For LLWU_P9
#define WUPE8                         0x00000006      // Wakeup Pin Enable For LLWU_P8


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE4 register.
//
//*****************************************************************************

#define WUPE15                        0x00000180      // Wakeup Pin Enable For LLWU_P15
#define WUPE14                        0x00000060      // Wakeup Pin Enable For LLWU_P14
#define WUPE13                        0x00000018      // Wakeup Pin Enable For LLWU_P13
#define WUPE12                        0x00000006      // Wakeup Pin Enable For LLWU_P12


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE5 register.
//
//*****************************************************************************

#define WUPE19                        0x00000180      // Wakeup Pin Enable For LLWU_P19
#define WUPE18                        0x00000060      // Wakeup Pin Enable For LLWU_P18
#define WUPE17                        0x00000018      // Wakeup Pin Enable For LLWU_P17
#define WUPE16                        0x00000006      // Wakeup Pin Enable For LLWU_P16


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE6 register.
//
//*****************************************************************************

#define WUPE23                        0x00000180      // Wakeup Pin Enable For LLWU_P23
#define WUPE22                        0x00000060      // Wakeup Pin Enable For LLWU_P22
#define WUPE21                        0x00000018      // Wakeup Pin Enable For LLWU_P21
#define WUPE20                        0x00000006      // Wakeup Pin Enable For LLWU_P20


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE7 register.
//
//*****************************************************************************

#define WUPE27                        0x00000180      // Wakeup Pin Enable For LLWU_P27
#define WUPE26                        0x00000060      // Wakeup Pin Enable For LLWU_P26
#define WUPE25                        0x00000018      // Wakeup Pin Enable For LLWU_P25
#define WUPE24                        0x00000006      // Wakeup Pin Enable For LLWU_P24


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE8 register.
//
//*****************************************************************************

#define WUPE31                        0x00000180      // Wakeup Pin Enable For LLWU_P31
#define WUPE30                        0x00000060      // Wakeup Pin Enable For LLWU_P30
#define WUPE29                        0x00000018      // Wakeup Pin Enable For LLWU_P29
#define WUPE28                        0x00000006      // Wakeup Pin Enable For LLWU_P28


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_ME register.
//
//*****************************************************************************

#define WUME7                         0x00000080      // Wakeup Module Enable For Module 7
#define WUME6                         0x00000040      // Wakeup Module Enable For Module 6
#define WUME5                         0x00000020      // Wakeup Module Enable For Module 5
#define WUME4                         0x00000010      // Wakeup Module Enable For Module 4
#define WUME3                         0x00000008      // Wakeup Module Enable For Module 3
#define WUME2                         0x00000004      // Wakeup Module Enable For Module 2
#define WUME1                         0x00000002      // Wakeup Module Enable For Module 1
#define WUME0                         0x00000001      // Wakeup Module Enable For Module 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PF1 register.
//
//*****************************************************************************

#define WUF7                          0x00000080      // Wakeup Flag For LLWU_P7
#define WUF6                          0x00000040      // Wakeup Flag For LLWU_P6
#define WUF5                          0x00000020      // Wakeup Flag For LLWU_P5
#define WUF4                          0x00000010      // Wakeup Flag For LLWU_P4
#define WUF3                          0x00000008      // Wakeup Flag For LLWU_P3
#define WUF2                          0x00000004      // Wakeup Flag For LLWU_P2
#define WUF1                          0x00000002      // Wakeup Flag For LLWU_P1
#define WUF0                          0x00000001      // Wakeup Flag For LLWU_P0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PF2 register.
//
//*****************************************************************************

#define WUF15                         0x00000080      // Wakeup Flag For LLWU_P15
#define WUF14                         0x00000040      // Wakeup Flag For LLWU_P14
#define WUF13                         0x00000020      // Wakeup Flag For LLWU_P13
#define WUF12                         0x00000010      // Wakeup Flag For LLWU_P12
#define WUF11                         0x00000008      // Wakeup Flag For LLWU_P11
#define WUF10                         0x00000004      // Wakeup Flag For LLWU_P10
#define WUF9                          0x00000002      // Wakeup Flag For LLWU_P9
#define WUF8                          0x00000001      // Wakeup Flag For LLWU_P8


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PF3 register.
//
//*****************************************************************************

#define WUF23                         0x00000080      // Wakeup Flag For LLWU_P23
#define WUF22                         0x00000040      // Wakeup Flag For LLWU_P22
#define WUF21                         0x00000020      // Wakeup Flag For LLWU_P21
#define WUF20                         0x00000010      // Wakeup Flag For LLWU_P20
#define WUF19                         0x00000008      // Wakeup Flag For LLWU_P19
#define WUF18                         0x00000004      // Wakeup Flag For LLWU_P18
#define WUF17                         0x00000002      // Wakeup Flag For LLWU_P17
#define WUF16                         0x00000001      // Wakeup Flag For LLWU_P16


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PF4 register.
//
//*****************************************************************************

#define WUF31                         0x00000080      // Wakeup Flag For LLWU_P31
#define WUF30                         0x00000040      // Wakeup Flag For LLWU_P30
#define WUF29                         0x00000020      // Wakeup Flag For LLWU_P29
#define WUF28                         0x00000010      // Wakeup Flag For LLWU_P28
#define WUF27                         0x00000008      // Wakeup Flag For LLWU_P27
#define WUF26                         0x00000004      // Wakeup Flag For LLWU_P26
#define WUF25                         0x00000002      // Wakeup Flag For LLWU_P25
#define WUF24                         0x00000001      // Wakeup Flag For LLWU_P24


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_MF5 register.
//
//*****************************************************************************

#define MWUF7                         0x00000080      // Wakeup flag For module 7
#define MWUF6                         0x00000040      // Wakeup flag For module 6
#define MWUF5                         0x00000020      // Wakeup flag For module 5
#define MWUF4                         0x00000010      // Wakeup flag For module 4
#define MWUF3                         0x00000008      // Wakeup flag For module 3
#define MWUF2                         0x00000004      // Wakeup flag For module 2
#define MWUF1                         0x00000002      // Wakeup flag For module 1
#define MWUF0                         0x00000001      // Wakeup flag For module 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_FILT1 register.
//
//*****************************************************************************

#define FILTF                         0x00000080      // Filter Detect Flag
#define FILTE                         0x000000C0      // Digital Filter On External Pin
#define FILTSEL                       0x000001F0      // Filter Pin Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_FILT2 register.
//
//*****************************************************************************

#define FILTF                         0x00000080      // Filter Detect Flag
#define FILTE                         0x000000C0      // Digital Filter On External Pin
#define FILTSEL                       0x000001F0      // Filter Pin Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_FILT3 register.
//
//*****************************************************************************

#define FILTF                         0x00000080      // Filter Detect Flag
#define FILTE                         0x000000C0      // Digital Filter On External Pin
#define FILTSEL                       0x000001F0      // Filter Pin Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_FILT4 register.
//
//*****************************************************************************

#define FILTF                         0x00000080      // Filter Detect Flag
#define FILTE                         0x000000C0      // Digital Filter On External Pin
#define FILTSEL                       0x000001F0      // Filter Pin Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLASC register.
//
//*****************************************************************************

#define ASC                           0x00007F80      // Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch's slave input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLAMC register.
//
//*****************************************************************************

