MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMI18/mcu.h
#define OVF_ERROR_EN                  0x00000010      // Determines whether OVF_ERROR condition signal is used in generation of USB_CLK_RECOVERY_INT


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_INT_STATUS register.
//
//*****************************************************************************

#define OVF_ERROR                     0x00000010      // A Write operation with value high at 1'b1 on any combination of individual bits will clear those bits


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CONTROL register.
//
//*****************************************************************************

#define SR                            0x02000000      // Software Reset
#define START                         0x01000000      // Start Change Detection Sequence
#define BC12                          0x00020000      // BC1.2 compatibility
#define IE                            0x00010000      // Interrupt Enable
#define IF                            0x00000100      // Interrupt Flag
#define IACK                          0x00000001      // Interrupt Acknowledge


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CLOCK register.
//
//*****************************************************************************

#define CLOCK_SPEED                   0x001FF800      // Numerical Value of Clock Speed in Binary
#define CLOCK_UNIT                    0x00000001      // Unit of Measurement Encoding for Clock Speed


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_STATUS register.
//
//*****************************************************************************

#define ACTIVE                        0x00400000      // Active Status Indicator
#define TO                            0x00200000      // Timeout Flag
#define ERR                           0x00100000      // Error Flag
#define SEQ_STAT                      0x00180000      // Charger Detection Sequence Status
#define SEQ_RES                       0x00060000      // Charger Detection Sequence Results


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_SIGNAL_OVERRIDE register.
//
//*****************************************************************************

#define PS                            0x00000006      // Phase Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER0 register.
//
//*****************************************************************************

#define TSEQ_INIT                     0x7FE000000      // Sequence Initiation Time
#define TUNITCON                      0x00078000      // Unit Connection Timer Elapse


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER1 register.
//
//*****************************************************************************

#define TDCD_DBNC                     0x7FE000000      // Time Period to Debounce D+ Signal
#define TVDPSRC_ON                    0x0007FE00      // Time Period Comparator Enabled


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER2_BC11 register.
//
//*****************************************************************************

#define TVDPSRC_CON                   0x7FE000000      // Time Period Before Enabling D+ Pullup
#define CHECK_DM                      0x00000078      // Time Before Check of D– Line


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER2_BC12 register.
//
//*****************************************************************************

#define TWAIT_AFTER_PRD               0x7FE000000      // 
#define TVDMSRC_ON                    0x0007FE00      //  ::


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ID register.
//
//*****************************************************************************

#define VERSIONID                     0x380000000      // Internal version counter.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HWGENERAL register.
//
//*****************************************************************************

#define SM                            0x00000C00      // Serial mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HWHOST register.
//
//*****************************************************************************

#define TTPER                         0x7F80000000      // Transaction translator periodic contexts.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HWDEVICE register.
//
//*****************************************************************************

#define DEVEP                         0x000003E0      // Device endpoints.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HWTXBUF register.
//
//*****************************************************************************

#define TXLC                          0x80000000      // Transmit local Context Registers


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HWRXBUF register.
//
//*****************************************************************************

